app/controllers/appointments_controller.rb

  def create
    @appointment = @patient.appointments.build(appointment_params) #Appointment.last
    # @appointment = Appointment.new(appointment_params)
    # @appointment.patient = @patient

    if @appointment.save
---
INSERT INTO "appointments" ("date", "field1", "field2", "field3", "field4", "field5", "field6", "field7", "field8", "field9", "text_field1", "text_field2", "text_field3", "patient_id", "created_at", "updated_at", "field10", "field11", "field12", "field13", "field14", "field15", "field16", "field17", "field18", "field19", "field20", "field21", "field22", "field23", "field24", "field25", "bool1", "bool2", "bool3", "bool4", "image", "image2") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38) RETURNING "id"

  def show
    @patient = Patient.find(@appointment.patient_id)
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    if @appointment.update appointment_params
---
UPDATE "appointments" SET "field5" = $1, "field6" = $2, "field9" = $3, "field10" = $4, "field12" = $5, "field13" = $6, "field14" = $7, "field15" = $8, "field18" = $9, "field19" = $10, "field20" = $11, "field21" = $12, "field22" = $13, "field23" = $14, "field24" = $15, "text_field1" = $16, "text_field2" = $17, "text_field3" = $18, "bool1" = $19, "bool2" = $20, "bool4" = $21, "updated_at" = $22 WHERE "appointments"."id" = $23

  def find_appointment
    @appointment = Appointment.find params[:id]
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def find_patient
    @patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]