app/controllers/patients_controller.rb

    def create
      @patient = Patient.new(patient_params)
      @patient.user_id = current_user.id

      if @patient.save
---
INSERT INTO "patients" ("first_name", "last_name", "gender", "address", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first_name", "Juano"], ["last_name", "chuy"], ["gender", ""], ["address", ""], ["user_id", 2], ["created_at", 2017-02-21 01:24:14 UTC], ["updated_at", 2017-02-21 01:24:14 UTC]]

    def show
      @appointments = Appointment.order(created_at: :desc).where("patient_id = #{@patient.id}")
---
SELECT "appointments".* FROM "appointments" WHERE (patient_id = 1) ORDER BY "appointments"."created_at" DESC

    def index
      # binding.pry
      @patients = Patient.order(last_name: :asc).where("user_id = #{current_user.id}")
---
SELECT "patients".* FROM "patients" WHERE (user_id = 1) ORDER BY "patients"."last_name" ASC

    def update
      if @patient.update patient_params
---
UPDATE "patients" SET "birth_date" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["birth_date", Sun, 20 Aug 1989], ["updated_at", 2017-03-14 02:00:29 UTC], ["id", 1]]

    def find_patient
      @patient = Patient.find params[:id]
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]