app/controllers/profile_controller.rb

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "profession" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Bernardo"], ["last_name", "Rubin"], ["profession", "Oftalmólogo"], ["updated_at", 2017-02-20 06:17:25 UTC], ["id", 1]]
---
  def update
    current_user.update(user_params)