app/views/appointments/index.html.erb

            <%= link_to q.date.to_date, appointment_path(q) %>
            <%= Patient.find_by_id(q.patient_id).last_name %>
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]